Revit 2027 API
Toposolid.HostTopoId Property
 The host Toposolid id of the current Toposolid subdivision. If the object is not a Toposolid subdivision, hostTopoId will be InvalidElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostTopoId { get; }
Public ReadOnly Property HostTopoId As ElementId
	Get
public:
property ElementId^ HostTopoId {
	ElementId^ get ();
}
member HostTopoId : ElementId with get
Property Value
ElementId
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace